In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [15]:
%sql SELECT * FROM fact_songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 5, 0, 33, 12, 796000), '69', 'free', None, None, 256, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 5, 1, 27, 22, 796000), '44', 'paid', None, None, 237, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (3, datetime.datetime(2018, 11, 5, 1, 30, 56, 796000), '44', 'paid', None, None, 237, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (4, datetime.datetime(2018, 11, 5, 1, 34, 54, 796000), '44', 'paid', None, None, 237, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (5, datetime.datetime(2018, 11, 5, 1, 40, 40, 796000), '44', 'paid', None, None, 237, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [13]:
%sql SELECT * FROM dim_users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('84', 'Shakira', 'Hunt', 'F', 'free'),
 ('24', 'Layla', 'Griffin', 'F', 'paid'),
 ('94', 'Noah', 'Chavez', 'M', 'free'),
 ('69', 'Anabelle', 'Simpson', 'F', 'free'),
 ('43', 'Jahiem', 'Miles', 'M', 'free')]

In [10]:
%sql SELECT * FROM dim_songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.93179)]

In [11]:
%sql SELECT * FROM dim_artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', nan, nan)]

In [12]:
%sql SELECT * FROM dim_time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 5, 0, 33, 12, 796000), 0, 5, 45, 11, 2018, 0),
 (datetime.datetime(2018, 11, 5, 1, 27, 22, 796000), 1, 5, 45, 11, 2018, 0),
 (datetime.datetime(2018, 11, 5, 1, 30, 56, 796000), 1, 5, 45, 11, 2018, 0),
 (datetime.datetime(2018, 11, 5, 1, 34, 54, 796000), 1, 5, 45, 11, 2018, 0),
 (datetime.datetime(2018, 11, 5, 1, 40, 40, 796000), 1, 5, 45, 11, 2018, 0)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).